import styles from "./Footer.module.css";

const Footer = () => {
  return (
    <footer className={styles.footer}>
      <div className={styles.top}>
        <div className={styles.socials}>
          <a
            href="https://vk.com/kinoonair"
            target="_blank"
            rel="noopener noreferrer"
          >
            <svg
              width={24}
              height={24}
              viewBox="0 0 24 24"
              className={styles.icon}
            >
              <path d="M23.408 1.372c.177-.558 0-.963-.786-.963h-2.61c-.66 0-.963.355-1.14.735 0 0-1.344 3.245-3.22 5.35-.608.608-.887.81-1.217.81-.177 0-.406-.203-.406-.76V1.346c0-.66-.203-.963-.76-.963H9.16c-.406 0-.66.304-.66.608 0 .634.938.786 1.04 2.56v3.854c0 .837-.152.99-.482.99-.887 0-3.042-3.27-4.335-6.997C4.47.662 4.217.383 3.558.383H.92c-.76 0-.887.355-.887.735 0 .685.887 4.132 4.132 8.696 2.155 3.118 5.223 4.792 7.986 4.792 1.673 0 1.876-.38 1.876-1.014v-2.358c0-.76.152-.887.685-.887.38 0 1.065.203 2.61 1.7 1.775 1.775 2.08 2.586 3.068 2.586H23c.76 0 1.115-.38.913-1.115-.228-.735-1.1-1.8-2.206-3.068-.608-.7-1.52-1.496-1.8-1.876-.38-.507-.28-.7 0-1.166-.025 0 3.17-4.513 3.5-6.034" />
            </svg>
          </a>

          <a
            href="https://ok.ru/kinoonair"
            target="_blank"
            rel="noopener
            noreferrer"
          >
            <svg
              width={24}
              height={24}
              viewBox="0 0 24 24"
              className={styles.icon}
            >
              <path d="M11.82 10.74c-.285-.574-1.075-1.052-2.124-.223C8.278 11.64 6 11.64 6 11.64s-2.278 0-3.696-1.12c-1.05-.83-1.84-.35-2.124.223-.497 1 .065 1.485 1.332 2.3 1.082.697 2.57.957 3.53 1.054l-3.777 3.787a1.16 1.16 0 0 0 0 1.64l.136.137a1.156 1.156 0 0 0 1.637 0l2.975-2.983L8.99 19.66a1.156 1.156 0 0 0 1.637 0l.136-.137a1.16 1.16 0 0 0 0-1.64l-3.78-3.79c.96-.1 2.432-.36 3.506-1.052 1.267-.815 1.83-1.3 1.332-2.3zM6 2.572c1.372 0 2.484 1.115 2.484 2.5S7.372 7.552 6 7.552s-2.484-1.115-2.484-2.5 1.112-2.5 2.484-2.5zm0 7.552c2.788 0 5.05-2.266 5.05-5.062S8.79 0 6 0 .95 2.266.95 5.062 3.21 10.124 6 10.124" />
            </svg>
          </a>
          <a
            href="https://web.max.ru/-70921793164739"
            target="_blank"
            rel="noopener noreferrer"
          >
            <svg
              width={24}
              height={24}
              viewBox="0 0 24 24"
              className={styles.icon}
            >
              <path d="M9.04 17.65c-1.737 0-2.544-.255-3.947-1.274-.888 1.146-3.698 2.042-3.82.51 0-1.15-.254-2.123-.542-3.184C.39 12.395 0 10.939 0 8.829 0 3.791 4.116 0 8.994 0 13.875 0 17.7 3.977 17.7 8.876a8.76 8.76 0 0 1-2.523 6.185A8.7 8.7 0 0 1 9.04 17.65m.072-13.295c-2.375-.123-4.226 1.528-4.636 4.117-.338 2.144.262 4.755.773 4.89.245.06.862-.441 1.247-.827a4.4 4.4 0 0 0 2.147.768 4.5 4.5 0 0 0 3.225-1.146 4.55 4.55 0 0 0 1.504-3.086 4.55 4.55 0 0 0-1.17-3.23 4.51 4.51 0 0 0-3.09-1.482z" />
            </svg>
          </a>
          <a
            href="https://www.youtube.com/@HeyLoCheys"
            target="_blank"
            rel="noopener noreferrer"
          >
            <svg
              width={24}
              height={24}
              viewBox="0 0 22 16"
              className={styles.icon}
            >
              <path d="M8.75 11.377V4.623L14.5 8zm12.8-8.878c-.253-.983-.998-1.758-1.945-2.02C17.88 0 11 0 11 0S4.12 0 2.405.478C1.458.74.713 1.515.46 2.498 0 4.28 0 8 0 8s0 3.72.46 5.502c.253.983 1 1.758 1.945 2.02C4.12 16 11 16 11 16s6.88 0 8.595-.478c.947-.263 1.692-1.037 1.945-2.02C22 11.72 22 8 22 8s0-3.72-.46-5.502z" />
            </svg>
          </a>
          <a
            href="https://t.me/KinoOn_Air"
            target="_blank"
            rel="noopener noreferrer"
          >
            <svg
              width={24}
              height={24}
              viewBox="0 0 21 18"
              className={styles.icon}
            >
              <path d="M19.61 1.11 1.89 7.94C.68 8.43.69 9.1 1.67 9.4l4.55 1.42 10.52-6.64c.5-.3 1-.14.58.19l-8.53 7.7-.31 4.69a1.18 1.18 0 0 0 .92-.46l2.21-2.15 4.59 3.4c.85.46 1.46.22 1.67-.79l3-14.22c.33-1.23-.45-1.8-1.26-1.43" />
            </svg>
          </a>
          <a
            href="https://www.facebook.com/KinoOnAir"
            target="_blank"
            rel="noopener noreferrer"
          >
            <svg
              width={24}
              height={24}
              viewBox="0 0 24 24"
              className={styles.icon}
            >
              <path d="M11.327 5.056c.712 0 1.29.08 1.753.22.462.16.848.398 1.194.737.328.358.559.757.694 1.216s.213 1.056.213 1.813v.997c0 1.276-.213 2.232-.637 2.83-.423.598-.937.962-2.08 1.137l3.102 4.345h-3.603l-2.815-4.325h-5.93v4.325H0V5.057zM3.219 7.988v3.109h7.587c.443 0 .751-.059.906-.198.155-.14.25-.4.25-.798V8.985c0-.379-.096-.638-.25-.777-.155-.14-.463-.22-.906-.22z" />
            </svg>
          </a>
        </div>

        <button className={styles.helpBtn}>
          <span className={styles.helpIcon}>💬</span>Нужна помощь?
        </button>
      </div>

      <div className={styles.links}>
        <div>
          <h4>Okko</h4>
          <ul>
            <li>О нас</li>
            <li>Окколокино</li>
            <li>Карьера в Окко</li>
            <li>Мерчшоп</li>
          </ul>
        </div>
        <div>
          <h4>Помощь</h4>
          <ul>
            <li>Список устройств</li>
            <li>Дистрибьюторам</li>
            <li>Контакты</li>
          </ul>
        </div>
        <div>
          <h4>Другое</h4>
          <ul>
            <li>Борьба с пиратством</li>
            <li>Документация</li>
          </ul>
        </div>
      </div>

      <div className={styles.bottom}>
        <div className={styles.logo}></div>
        <div className={styles.text}>
          <p>© 2012-2026 ООО «Окко» 18+</p>
          <p>
            Общероссийские каналы доступны для бесплатного просмотра
            круглосуточно
          </p>
          <p>ПО ООО «Окко» состоит в реестре отечественного ПО</p>

          <div className={styles.linksInline}>
            <span>Пользовательские соглашения</span>
            <span>Политика конфиденциальности</span>
          </div>

          <p>
            На информационном ресурсе применяются рекомендательные технологии в
            соответствии с Правилами
          </p>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
